<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [1]:
import numpy as np
import pandas as pd

DataFrame

* 2차원 형태의 자료형이다.
* 인덱스, 컬럼, value값으로 이루어져 있다.

In [2]:
import pandas as pd
import numpy as np

# 선언

## from List

- by List : 리스트1 + 리스트2 +... + 컬럼 이름 = 데이타 프레임

In [3]:
a = [1, 3, 4, 5, 6]
b = [3, 2, 1, 1, 1]
pd.DataFrame([a,b])

   0  1  2  3  4
0  1  3  4  5  6
1  3  2  1  1  1

In [4]:
pd.DataFrame({'a':a, 'b':b})

   a  b
0  1  3
1  3  2
2  4  1
3  5  1
4  6  1

In [5]:
list_data = [[1,2,3],[4,5,6], [7,8,9],[10,11,12],[13,14,15]]
pd.DataFrame(list_data)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

## from dict

In [6]:
pd.DataFrame([{'A':2, 'B':4, 'D':3},{'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [7]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2' : [7,8,9],'c3' : [10,11,12], 'c4':[13,14,15]}
pd.DataFrame(dict_data)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## Series 와 비교를 해보자면

* Series 는 1차원이기 때문에 key 값이 1개라면 Series가 된다. 
* DataFrame 은 2차원이기 때문에 key 값이 2개가 필요하다.
    - 만약 키 값이 1개면, 그 키값은 column에 우선 할당되고, 인덱스는 자동 설정된다.

In [8]:
male_tuple = {'서울특별시': 4732275,
              '부산광역시': 1668618,
              '인천광역시': 1476813,
              '대구광역시': 1198815,
              '대전광역시': 734441,
              '광주광역시': 720060}
female_tuple = {'서울특별시': 4988571,
                '부산광역시': 1735805,
                '인천광역시': 1470404,
                '대구광역시': 1229139,
                '대전광역시': 736599,
                '광주광역시': 734988}

In [9]:
pd.Series(male_tuple)

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [10]:
pd.Series(male_tuple).index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [11]:
pd.Series([male_tuple,female_tuple])

0    {'서울특별시': 4732275, '부산광역시': 1668618, '인천광역시': ...
1    {'서울특별시': 4988571, '부산광역시': 1735805, '인천광역시': ...
dtype: object

In [12]:
pd.Series([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

In [13]:
pd.DataFrame([male_tuple,female_tuple])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

In [14]:
pd.DataFrame([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

## from Series

- by Series :시리즈1 + 시리즈2 + 시리즈3 + 시리즈4 = 데이타프레임

In [15]:
male = pd.Series(male_tuple)
female = pd.Series(female_tuple)

* 아래와 같이 되는 이유는 각각의 value 값에 대응한 시리즈의 index가 컬럼으로 바뀌기 때문이다. 
    - 만약 키 값이 1개면, 그 키값은 column에 우선 할당되고, 인덱스는 자동 설정된다.

In [16]:
pd.DataFrame([male, female])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

간단하게 전치를 해서 컬럼과 인덱스를 바꿀수도 있지만,

In [17]:
pd.DataFrame([male, female]).T

             0        1
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

### 아래와 같이 컬럼값을 지정해서 Series의 index를 DataFrame의 키값으로 변형할 수 있다. 

**DataFrame 생성시에 column을 적어주느냐와 안적어주느냐는 큰 차이가 있다.**

In [18]:
pd.DataFrame({'남자인구수': male, '여자인구수':female})

         남자인구수    여자인구수
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

## from np.random

In [19]:
pd.DataFrame(np.random.randn(4,4))

          0         1         2         3
0 -1.045313  0.481794  0.321574 -2.001203
1 -0.118450  0.524033 -1.156817  1.690314
2  0.444609 -0.086804  2.762558  2.597173
3  0.399464 -0.074743 -0.453328 -0.168515

In [20]:
pd.DataFrame(np.random.randint(1, 7, (7,7)))

   0  1  2  3  4  5  6
0  5  1  3  4  6  2  2
1  2  6  5  1  5  1  2
2  5  2  3  1  3  5  4
3  1  3  1  2  4  6  3
4  6  4  6  4  3  5  3
5  1  2  2  1  5  4  5
6  5  1  2  4  4  1  5

In [21]:
nrows, ncols = 10, 10
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows, ncols)) for i in range(4))
df3

,0,1,2,3,4,5,6,7,8,9
0,0.244114,0.929736,0.310150,0.924670,0.862529,0.855594,0.127457,0.687766,0.826255,0.365036
1,0.941885,0.513872,0.497796,0.899255,0.294325,0.616587,0.303041,0.915206,0.284539,0.908470
2,0.725219,0.893657,0.405087,0.633143,0.558671,0.475474,0.369561,0.120987,0.684223,0.641337
3,0.408985,0.227351,0.204302,0.631214,0.861625,0.121166,0.794413,0.534128,0.079771,0.046025
4,0.570377,0.188530,0.379692,0.120502,0.766641,0.275021,0.837355,0.909801,0.115160,0.842051
5,0.449671,0.770009,0.605920,0.393400,0.118885,0.684135,0.978289,0.380971,0.931651,0.283809
6,0.871976,0.506253,0.382094,0.464590,0.229783,0.676843,0.210797,0.027998,0.863209,0.879764
7,0.314996,0.729375,0.553457,0.571220,0.854100,0.869326,0.587867,0.947915,0.499601,0.182077
8,0.098656,0.985104,0.505245,0.541526,0.108020,0.108569,0.700664,0.364890,0.069772,0.675575
9,0.503971,0.407570,0.397817,0.781643,0.199184,0.865706,0.359719,0.764930,0.670105,0.820834

## OrderedDict로 데이터프레임 생성하기
OrderedDict 자료구조로 데이터프레임을 생성하면, 컬럼의 순서가 뒤바뀌지 않습니다.

In [22]:
from collections import OrderedDict

In [23]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from other sauce

* pd.read_csv 등등 수많은 sauce( html, json, 등등)

## from other DataFrame

- by other dataframe's columns : 컬럼1 + 컬럼2  +...= 데이타 프레임 
- by other dataframe's columns : dfA 컬럼 1 + dfB 컬럼 2   +...= 데이타 프레임

In [24]:
df1 = pd.DataFrame(np.random.randn(5,3), index=pd.date_range('01/02/2014',periods=5,freq='D'), columns=['a','b','c'] )
df2 = pd.DataFrame(np.random.randn(8,3), index=pd.date_range('01/01/2014',periods=8,freq='D'), columns=['a','b','c'] )

In [25]:
df1

                   a         b         c
2014-01-02 -1.216909 -0.625671 -0.006455
2014-01-03  0.675490  1.063694  0.794528
2014-01-04  1.461711 -1.019393  0.327433
2014-01-05 -2.406654  0.525763  0.475469
2014-01-06 -0.922334 -0.382129  0.420474

In [26]:
df1['a']

2014-01-02   -1.216909
2014-01-03    0.675490
2014-01-04    1.461711
2014-01-05   -2.406654
2014-01-06   -0.922334
Freq: D, Name: a, dtype: float64

In [27]:
# 시리즈를 2개 묶은것
pd.DataFrame([df1['a'],df2['b']])

,2014-01-01,2014-01-02,2014-01-03,2014-01-04,2014-01-05,2014-01-06,2014-01-07,2014-01-08
a,NaN,-1.216909,0.675490,1.461711,-2.406654,-0.922334,NaN,NaN
b,0.428775,1.091989,-0.322614,1.644812,1.323992,0.691642,-0.782043,-1.488231

In [28]:
pd.DataFrame({'a':df1['a'], 'b': df2['b']})

                   a         b
2014-01-01       NaN  0.428775
2014-01-02 -1.216909  1.091989
2014-01-03  0.675490 -0.322614
2014-01-04  1.461711  1.644812
2014-01-05 -2.406654  1.323992
2014-01-06 -0.922334  0.691642
2014-01-07       NaN -0.782043
2014-01-08       NaN -1.488231

In [29]:
pd.DataFrame(df1[['a','b']])

                   a         b
2014-01-02 -1.216909 -0.625671
2014-01-03  0.675490  1.063694
2014-01-04  1.461711 -1.019393
2014-01-05 -2.406654  0.525763
2014-01-06 -0.922334 -0.382129

In [30]:
pd.DataFrame({'a':df1['a'], 'b':df1['b']})

                   a         b
2014-01-02 -1.216909 -0.625671
2014-01-03  0.675490  1.063694
2014-01-04  1.461711 -1.019393
2014-01-05 -2.406654  0.525763
2014-01-06 -0.922334 -0.382129

# 조회

## `info()` & `describe()`

## 조회 및 출력 `iterrows()`, `itertuples()`, `iteritems()`

In [31]:
import pandas as pd


df = pd.DataFrame({'A': list('ABCDABCDAB'), 'num': range(10)})

### `iterrows()`

In [32]:
for row in df.iterrows():
    print(row)
    break

(0, A      A
num    0
Name: 0, dtype: object)

In [33]:
for row in df.iterrows():
    print('key:', row[0], 'val:', row[1])
    break

key: 0 val: A      A
num    0
Name: 0, dtype: object

In [34]:
for k, v in df.iterrows():
    print(k, v['A'],v['num'])

0 A 0
1 B 1
2 C 2
3 D 3
4 A 4
5 B 5
6 C 6
7 D 7
8 A 8
9 B 9

### `itertuples()`

In [35]:
for t in df.itertuples():
    print("tuple", t)

tuple Pandas(Index=0, A='A', num=0)
tuple Pandas(Index=1, A='B', num=1)
tuple Pandas(Index=2, A='C', num=2)
tuple Pandas(Index=3, A='D', num=3)
tuple Pandas(Index=4, A='A', num=4)
tuple Pandas(Index=5, A='B', num=5)
tuple Pandas(Index=6, A='C', num=6)
tuple Pandas(Index=7, A='D', num=7)
tuple Pandas(Index=8, A='A', num=8)
tuple Pandas(Index=9, A='B', num=9)

In [36]:
for i, a, b in df.itertuples():
    print('index: ', i, 'A:', a, 'num:', b)

index:  0 A: A num: 0
index:  1 A: B num: 1
index:  2 A: C num: 2
index:  3 A: D num: 3
index:  4 A: A num: 4
index:  5 A: B num: 5
index:  6 A: C num: 6
index:  7 A: D num: 7
index:  8 A: A num: 8
index:  9 A: B num: 9

### `iteritems()`

In [37]:
for  a, b in df.iteritems():
    print( 'A:', a, 'num:', b)

A: A num: 0    A
1    B
2    C
3    D
4    A
5    B
6    C
7    D
8    A
9    B
Name: A, dtype: object
A: num num: 0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: num, dtype: int64

출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas